chimarkhi/qtag-nrf-sdk12/nRF5_SDK_12.2.0_f012efa/examples/ble_peripheral/ble_app_temp_queuing/main.c
/* Copyright (c) 2014 Nordic Semiconductor. All Rights Reserved.
 *
 * The information contained herein is property of Nordic Semiconductor ASA.
 * Terms and conditions of usage are described in detail in NORDIC
 * SEMICONDUCTOR STANDARD SOFTWARE LICENSE AGREEMENT.
 *
 * Licensees are granted free, non-transferable use of the information. NO
 * WARRANTY of ANY KIND is provided. This heading must NOT be removed from
 * the file.
 *
 */

/** @file
 *
 * @defgroup ble_sdk_app_beacon_main main.c
 * @{
 * @ingroup ble_sdk_app_beacon
 * @brief Beacon Transmitter Sample Application main file.
 *
 * This file contains the source code for an Beacon transmitter sample application.
 */

#include <stdbool.h>
#include <stdint.h>
#include <inttypes.h>
#include "main.h"

#define  NRF_LOG_MODULE_NAME 			"APP"
#include "nrf_log.h"
#include "advertising.h"

static ble_nus_t                        m_nus;                                      /**< Structure to identify the Nordic UART Service. */
//static ble_tbs_t						m_tbs;																			/**< Structure to identify the TagBox Service. */
static uint16_t                         m_conn_handle = BLE_CONN_HANDLE_INVALID;    /**< Handle of the current connection. */
static nrf_drv_twi_t 					twi = NRF_DRV_TWI_INSTANCE(0);



// Global variables
uint16_t nusRecKey;
uint16_t nusCurrentKey;
uint32_t tstamp_sec;

volatile advertising_mode_t advMode;
volatile bool initFlag = false;
volatile bool gcDone = false;
volatile bool writeFlag = false;
volatile uint8_t syncType = SYNCTYPE_STRAIGHT;


APP_TIMER_DEF(m_advdata_update_timer);
APP_TIMER_DEF(m_dataToDB_timer);
APP_TIMER_DEF(m_tstamp_timer);
APP_TIMER_DEF(m_dynadv_timer_timer);

/***@brief function for initializing nrf logging.
*/
void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);
}

void dynadv_timer_timeout_handler(void * p_context)
{
	switch(advMode)
	{
		case DYNADV_ADV_MODE_FAST:
			dynamic_advertising_handler(advMode, DYNADV_EVT_FAST_MODE_TIMEOUT);
			break;
		case DYNADV_ADV_MODE_SLOW_UNCONN:
			dynamic_advertising_handler(advMode, DYNADV_EVT_UNCONN_MODE_TIMEOUT);
			break;
		default:
			break;
	}
}

void advdata_update_timer_timeout_handler(void * p_context)
{
	advdata_update(advMode);
	indicate_advertising(advMode);
}

void tstamp_timer_timeout_handler(void * p_context)
{
	++tstamp_sec;
}

uint32_t get_timeStamp(void)
{
	return tstamp_sec;
}

/**@brief Function for the tstamp and record key
 *
 * @details Initializes reckey and tstamp from last record key and timestamp stored in REC_KEY_LASTSEEN.
 * @details a check on read data's reckey is made, to see if it is within expected range. Otherwise tstamp 
 * @details and recCounter initialized to 0
 * @details Should be called only on device reset (battery change)
 */
void tstamp_reckey_init()
{
		uint32_t data[] 	= {0,0,0};
		uint8_t dataLen 	= sizeof(data);
		uint32_t err_code;
		err_code = fds_read(BACKUP_FILE_ID, REC_KEY_LASTSEEN, data, &dataLen);
		if (err_code != NRF_SUCCESS) NRF_LOG_ERROR("FDS read error %d", err_code);
		
		if ((data[0] <= (uint32_t)0xFFFF)
			& (data[0] >= (uint32_t)REC_KEY_START )
			& (err_code == FDS_SUCCESS)	)
		{
			tstamp_sec = data[1]+1;
			recCounter_init((uint16_t)data[0]+1);
		}
		else
		{
			tstamp_sec = 0;
			recCounter_init(REC_KEY_START);
		}
		
		NRF_LOG_INFO("Starting from RECKEY,tstamp: [%04x,%08x]\r\n",(uint16_t)data[0],tstamp_sec);
}

uint32_t get_telemetry_data(uint16_t* temp, uint8_t* humid, uint8_t* batt_level, uint32_t* timeStamp, uint16_t* recKey)
{
		uint32_t temp_humid;
		
		#ifdef NRF51
			temp_humid 	= 47;
			batt_level 	= 74;
		#else	
			temp_humid 	= get_temp_humid(&twi);
			*batt_level 	= get_battery_level();
		#endif
	
		if (temp_humid == I2C_READ_ERROR)
		{
			return I2C_READ_ERROR;
		}
		else
		{
			*temp			= (uint16_t)(temp_humid>>16);
			*humid			= (uint8_t)temp_humid;
		}
		
		// Add logic to do data sanity checks on temperature, humidity and battery
		
		*timeStamp = tstamp_sec;
		*recKey = get_recKey();
		
		return NRF_SUCCESS;
}


void dataToDB_timer_timeout_handler(void * p_context)
{
		uint32_t	timeStamp;
		uint16_t 	temp;
		uint8_t 	humid, batt_level;
		uint16_t 	recKey;
			
		uint32_t err_code = get_telemetry_data(&temp, &humid, &batt_level, &timeStamp, &recKey);		
		if (err_code != NRF_SUCCESS) return; // Do not store data in local db in case of errors
	
		uint32_t dataPacket[WORDLEN_DATAPACKET] = {recKey,
													timeStamp,
													(temp << 16) | (humid << 8) | batt_level};	

		NRF_LOG_RAW_INFO("\r\n\n\n");
		NRF_LOG_DEBUG("Data to DB: RecKey %08x, time %08x, data %08x\r\n", dataPacket[0], dataPacket[1], dataPacket[2]);
		err_code = dataToDB(FILE_ID, recKey, dataPacket, WORDLEN_DATAPACKET);
		// if data saved successfully, update the last seen reckey and tstamp in flash												 

		if (err_code == NRF_SUCCESS) 
		{
//			wait_for_fds_evt(FDS_EVT_WRITE);
			err_code = fds_find_and_delete(BACKUP_FILE_ID, REC_KEY_LASTSEEN);
			err_code = fds_write(BACKUP_FILE_ID, REC_KEY_LASTSEEN, dataPacket, WORDLEN_DATAPACKET);
		}
		else	NRF_LOG_ERROR("DataToDB error : %d", err_code); 
}

/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module.
 */
static void timers_init(void)
{
    // Initialize timer module, making it use the scheduler
    APP_TIMER_APPSH_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, true);

    uint32_t err_code = app_timer_create(&m_advdata_update_timer, APP_TIMER_MODE_REPEATED, advdata_update_timer_timeout_handler);
    APP_ERROR_CHECK(err_code);
	
    err_code = app_timer_create(&m_dataToDB_timer, APP_TIMER_MODE_REPEATED, dataToDB_timer_timeout_handler);
    APP_ERROR_CHECK(err_code);

	err_code = app_timer_create(&m_tstamp_timer, APP_TIMER_MODE_REPEATED, tstamp_timer_timeout_handler);
    APP_ERROR_CHECK(err_code);	

	//Create timer used in dynamic advertising for FAST_MODE and UNCONN_MODE timeouts
	err_code = app_timer_create(&m_dynadv_timer_timer, APP_TIMER_MODE_SINGLE_SHOT, dynadv_timer_timeout_handler);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for starting timers.
*/
static void timers_start(void)
{
    uint32_t err_code = app_timer_start(m_advdata_update_timer, ADVDATA_UPDATE_INTERVAL, NULL);
    APP_ERROR_CHECK(err_code);
	
    err_code = app_timer_start(m_dataToDB_timer, LOGINTERVAL_ADVINTERVAL_RATIO*ADVDATA_UPDATE_INTERVAL, NULL);
    APP_ERROR_CHECK(err_code);

    err_code = app_timer_start(m_tstamp_timer, TSTAMP_INTERVAL, NULL);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for starting dynamic advertising timeout timers
*/
uint32_t dynadv_timeout_timer_start(uint32_t timer_ticks)
{
    uint32_t err_code = app_timer_start(m_advdata_update_timer, timer_ticks, NULL);
    return err_code;
}

/**@brief Function for starting dynamic advertising timeout timers
*/
uint32_t dynadv_timeout_timer_stop(void)
{
    uint32_t err_code = app_timer_stop(m_advdata_update_timer);
    return err_code;					// TBD error handling
}


/**@brief 	Function for reloading advdata update timer with new timeout value 
	 @details	In case of failure restart the timer with default value
	 @input 	timeout_ticks: 	new value to be loaded
*/
uint32_t dynadv_timer_update(uint32_t timeout_ticks)
{
	uint32_t err_code = app_timer_stop(m_advdata_update_timer);
	
	if (err_code == NRF_SUCCESS)
	{
		err_code = app_timer_start(m_advdata_update_timer, timeout_ticks, NULL);
		NRF_LOG_INFO("Timer restarted with NEW timeout value: %d\r\n", timeout_ticks);
	}
	else 
	{
		NRF_LOG_ERROR("Timer could not be restarted with new timeout value error: %d\r\n", timeout_ticks);
	}
	return err_code;
}


static void gap_params_init(void)
{
		uint32_t                err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);
    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *)DEVICE_NAME,
                                          strlen(DEVICE_NAME));
		APP_ERROR_CHECK(err_code);

    err_code = sd_ble_gap_appearance_set(BLE_APPEARANCE_HEART_RATE_SENSOR_HEART_RATE_BELT);
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);

