chimarkhi/qtag-nrf-sdk12/nRF5_SDK_12.2.0_f012efa/examples/ble_peripheral/ble_app_temp_queuing/main.c
}




/**@brief Function for handling the data from the Nordic UART Service.
 *
 * @details This function will process the data received from the Nordic UART BLE Service and send
 *          it to the UART module.
 *
 * @param[in] p_nus    Nordic UART Service structure.
 * @param[in] p_data   Data to be send to UART module.
 * @param[in] length   Length of the data.
 */
/**@snippet [Handling the data received over BLE] */
static void nus_data_handler(ble_nus_t * p_nus, uint8_t * p_data, uint16_t length)
{
			NRF_LOG_INFO("Inside nus data handler\r\n");

			NRF_LOG_INFO("data from central (Only 2 bytes used by code):");	
			for (uint32_t i = 0; i < length; i++)
			{
				NRF_LOG_RAW_INFO("%02x",p_data[1-i]);
			}
			NRF_LOG_RAW_INFO("\r\n");
			uint16_t inRecKey = p_data[1]<<8|p_data[0];
//			uint16_t inRecKey = (((p_data[0]-0x30)&0x0F)<<12|
//								((p_data[1]-0x30)&0x0F)<<8|
//								((p_data[2]-0x30)&0x0F)<<4|
//								((p_data[3]-0x30)&0x0F));
			NRF_LOG_INFO("Start record : 0x%04x\r\n", inRecKey);
			nusCurrentKey = get_recKey();
			
			// If Record Key sent by TagLink isnt 0x0000 start data tx from appropiate point found using check_startRecKey()
			// else send error message 
			syncType = check_startRecKey(inRecKey, nusCurrentKey);
			if (syncType != SYNCTYPE_INVALID)
			{
				NRF_LOG_INFO("Starting data transfer from %04x, syncType %d\r\n", nusRecKey,syncType);
				payload_to_central_async(&m_nus, nusRecKey);
			}
			else 
			{
				NRF_LOG_WARNING("Invalid input recKey, Sending EOM\r\n\n");
				nus_eom_send(&m_nus,NUS_MSGTYPE_DIRTYRECKEY);
			}
}
/**@snippet [Handling the data received over BLE] */

/**@brief Function for initializing services that will be used by the application.
 */
static uint32_t services_init(void)
{
    uint32_t       err_code;
    ble_nus_init_t nus_init;

    memset(&nus_init, 0, sizeof(nus_init));

    nus_init.data_handler = nus_data_handler;
		
	  // Add Nordic Uart Service to GATT 
    err_code = ble_nus_init(&m_nus, &nus_init);
    if (err_code != NRF_SUCCESS) return err_code;

		// Add TagBox Service to GATT
		//err_code = ble_tbs_init(&m_tbs);
		//if (err_code != NRF_SUCCESS) return err_code;
		
		return err_code;
}

/**@brief Function for handling an event from the Connection Parameters Module.
 *
 * @details This function will be called for all events in the Connection Parameters Module
 *          which are passed to the application.
 *
 * @note All this function does is to disconnect. This could have been done by simply setting
 *       the disconnect_on_fail config parameter, but instead we use the event handler
 *       mechanism to demonstrate its use.
 *
 * @param[in] p_evt  Event received from the Connection Parameters Module.
 */
static void on_conn_params_evt(ble_conn_params_evt_t * p_evt)
{
    uint32_t err_code;

    if (p_evt->evt_type == BLE_CONN_PARAMS_EVT_FAILED)
    {
        err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
        APP_ERROR_CHECK(err_code);
    }
}

/**@brief Function for handling errors from the Connection Parameters module.
 *
 * @param[in] nrf_error  Error code containing information about what went wrong.
 */
static void conn_params_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}

/**@brief Function for initializing the Connection Parameters module.
 */
static void conn_params_init(void)
{
    uint32_t               err_code;
    ble_conn_params_init_t cp_init;

    memset(&cp_init, 0, sizeof(cp_init));

    cp_init.p_conn_params                  = NULL;
    cp_init.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
    cp_init.next_conn_params_update_delay  = NEXT_CONN_PARAMS_UPDATE_DELAY;
    cp_init.max_conn_params_update_count   = MAX_CONN_PARAMS_UPDATE_COUNT;
    cp_init.start_on_notify_cccd_handle    = BLE_GATT_HANDLE_INVALID;
    cp_init.disconnect_on_fail             = false;
    cp_init.evt_handler                    = on_conn_params_evt;
    cp_init.error_handler                  = conn_params_error_handler;

    err_code = ble_conn_params_init(&cp_init);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for putting the chip into sleep mode.
 *
 * @note This function will not return.
 */
static void sleep_mode_enter(void)
{
    uint32_t err_code = bsp_indication_set(BSP_INDICATE_IDLE);
    APP_ERROR_CHECK(err_code);

    // Prepare wakeup buttons.
    err_code = bsp_btn_ble_sleep_mode_prepare();
    APP_ERROR_CHECK(err_code);

    // Go to system-off mode (this function will not return; wakeup will cause a reset).
    err_code = sd_power_system_off();
    APP_ERROR_CHECK(err_code);
}

void sync_handler(void)
{
	uint8_t nus_status;
	uint32_t err_code;
	nusRecKey++;
	nus_status = check_nusRecKey(nusRecKey, nusCurrentKey);
	if(nus_status == NUS_CONTINUE) payload_to_central_async(&m_nus, nusRecKey);
	else if (nus_status == NUS_STOP)
	{
		err_code = nus_eom_send(&m_nus, NUS_MSGTYPE_EOM);
		if (err_code != NRF_SUCCESS) {
			NRF_LOG_ERROR("Err sending eom package: %d\r\n", err_code);
		}
		else NRF_LOG_INFO("EOM sent \r\n");
	}
}

/**@brief Function for the application's SoftDevice event handler.
 *
 * @param[in] p_ble_evt SoftDevice event.
 */
static void on_ble_evt(ble_evt_t * p_ble_evt)
{
    uint32_t err_code;
	uint8_t nus_status;
	ble_gap_addr_t peerAddress;
	
    switch (p_ble_evt->header.evt_id)
    {
		case BLE_GAP_EVT_SCAN_REQ_REPORT:			// On being scanned by a gateway device
			peerAddress = p_ble_evt->evt.gap_evt.params.scan_req_report.peer_addr;
			uint8_t rssiValue = p_ble_evt->evt.gap_evt.params.scan_req_report.rssi;
			NRF_LOG_DEBUG("Advertisement Scanned by GW RSSI: %d\r\n",rssiValue);
			NRF_LOG_DEBUG("Advertisement Scanned by GW RSSI: %02x:%02x:%02x:%02x\r\n",
						peerAddress.addr[0],peerAddress.addr[1],peerAddress.addr[4],peerAddress.addr[5]);
//			if ((peerAddress.addr[0] == 0xDF) | (peerAddress.addr[0] == 0x5C)) {
			advMode = dynamic_advertising_handler(advMode,DYNADV_EVT_GATEWAY_FOUND);
//			}
			break;

		case BLE_GAP_EVT_CONNECTED:
			advMode = dynamic_advertising_handler(advMode,DYNADV_EVT_CONNECTED);
			err_code = bsp_indication_set(BSP_INDICATE_CONNECTED);
			APP_ERROR_CHECK(err_code);
			m_conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
			nrf_gpio_pin_write(18,1);				// Minew S1 v1.0 Red LED
			//nrf_gpio_pin_write(18,1);				// Minew S1 v0.9 Red LED
			break; // BLE_GAP_EVT_CONNECTED

		case BLE_EVT_TX_COMPLETE:					// Send next key event
			NRF_LOG_INFO("\r\nTX Complete\r\n");
			sync_handler();
			break; // BLE_EVT_TX_COMPLETE

		case BLE_GAP_EVT_DISCONNECTED:
			nrf_gpio_pin_write(18,0);				// Minew S1 v1.0 Red LED
			//nrf_gpio_pin_write(18,0);			// Minew S1 v0.9 Red LED
			syncType = SYNCTYPE_STRAIGHT;
			nus_status = check_nusRecKey(nusRecKey, nusCurrentKey);
			if (nus_status == NUS_CONTINUE) advMode = dynamic_advertising_handler(advMode, DYNADV_EVT_CONN_DROPPED);
			else advMode = dynamic_advertising_handler(advMode, DYNADV_EVT_DATA_SYNCED);
			m_conn_handle = BLE_CONN_HANDLE_INVALID;
			break; // BLE_GAP_EVT_DISCONNECTED

		case BLE_GAP_EVT_SEC_PARAMS_REQUEST:			// Pairing not supported
			err_code = sd_ble_gap_sec_params_reply(m_conn_handle, BLE_GAP_SEC_STATUS_PAIRING_NOT_SUPP, NULL, NULL);
			APP_ERROR_CHECK(err_code);
			break; // BLE_GAP_EVT_SEC_PARAMS_REQUEST

