chimarkhi/qtag-nrf-sdk12/nRF5_SDK_12.2.0_f012efa/examples/ble_peripheral/ble_app_temp_queuing/main.c
/**@brief Function for doing power management.
 */
static void power_manage(void)
{
		uint32_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}

/**
 * @brief Function for application main entry.
 */
int main(void)
{
	uint32_t err_code = NRF_SUCCESS;
	bsp_board_leds_init();
	nrf_delay_ms(2000); // To allow for bounce during battery insertion
	APP_SCHED_INIT(SCHED_MAX_EVENT_DATA_SIZE, SCHED_QUEUE_SIZE);

	// Initialize.
	log_init();
	NRF_LOG_INFO("Starting Logging\n");
	NRF_LOG_INFO("\r\n\n\n\nInitializing ...\n");

	timers_init();
	NRF_LOG_INFO("Timers Initialized \n");

	err_code = bsp_init(BSP_INIT_LED, APP_TIMER_TICKS(100, APP_TIMER_PRESCALER), NULL);
	if(err_code == NRF_SUCCESS)	{	NRF_LOG_INFO("Initialized BSP \n");}
	else NRF_LOG_ERROR("Error in initialzing BSP rc: %d\r\n", err_code);

	err_code = buttons_leds_init(false);
	if (err_code != NRF_SUCCESS)
	{
		NRF_LOG_ERROR("LEDs init error %d\r\n", err_code);
	}
	else NRF_LOG_INFO("LEDs Initialized \n");

	ble_stack_init();
	gap_params_init();
	NRF_LOG_INFO("ble stack Initialized \n");
		
	adc_configure();

	//Initialize advMode to OFF
	advMode = advertising_init();
	NRF_LOG_INFO("Adv Initialized \n");

	err_code = services_init();
	if (err_code != NRF_SUCCESS) NRF_LOG_ERROR("Services init error %d\r\n", err_code);
	//else NRF_LOG_INFO("Services Initialized \n");

	conn_params_init();
	NRF_LOG_INFO("Conn Params Initialized \n");

	err_code = twi_init(&twi);
	NRF_LOG_INFO("SHT31's I2C Initialized \n");

	// Wait for fds to be initialized before any read/write
	err_code =fds_bledb_init();
	if (err_code != NRF_SUCCESS)
	{
		NRF_LOG_ERROR("fds init err: %d \n",err_code);
	}
	else NRF_LOG_INFO("fds initialized\r\n");
	APP_ERROR_CHECK(err_code);
	// POLL FOR INIT CALLBACK
	wait_for_fds_evt(FDS_EVT_INIT);

#ifdef INIT_DEVICE

	NRF_LOG_INFO("\r\n\n----Device Flash Init Begin----\n");

	err_code = fds_file_delete(FILE_ID);
	NRF_LOG_ERROR("file del err: %d \n",err_code);
	APP_ERROR_CHECK(err_code);
	NRF_LOG_RAW_INFO("\r\n\n");
	// Wait for GC to complete on FILE
	wait_for_fds_evt(FDS_EVT_GC);

	err_code = fds_file_delete(BACKUP_FILE_ID);
	NRF_LOG_ERROR("file del err: %d \n",err_code);
	APP_ERROR_CHECK(err_code);
	NRF_LOG_RAW_INFO("\r\n\n");
	// Wait for GC to complete on FILE
	wait_for_fds_evt(FDS_EVT_GC);


	NRF_LOG_INFO("Writing data to LASTSEEN record:\r\n");
	uint32_t testData[] = {(uint32_t)REC_KEY_START,0x00000000,0x00000000};
	err_code = fds_write(BACKUP_FILE_ID, REC_KEY_LASTSEEN, testData, 3);
	APP_ERROR_CHECK(err_code);
	// Wait for write done event
	wait_for_fds_evt(FDS_EVT_WRITE);

	NRF_LOG_RAW_INFO("----Device Flash Init Done----\r\n\n\n");
#endif

	nrf_delay_ms(1000);
	tstamp_reckey_init();

	// Start execution.
	nrf_delay_ms(1000);
	timers_start();
	NRF_LOG_INFO("Timers Start.. \n");

	// Switch on advertising in SLOW connectable mode
	advMode = dynamic_advertising_handler(advMode, DYNADV_EVT_BUTTON_PRESS);

	bsp_board_leds_on();
		
    // Enter main loop.
    for (;; )
    {
        if (NRF_LOG_PROCESS() == false)
        {
        	app_sched_execute();
        	power_manage();
        }
    }
}
